
## Plan Result (stg.cube-unit.net)

[CI link](https://github.com/shimosyan/cube-unit.net/actions/runs/16529990395)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudfront_distribution.s3_distribution
  * aws_s3_bucket_policy.policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::stg.cube-unit.net",
              + "arn:aws:s3:::stg.cube-unit.net/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                         = [
          + "stg.cube-unit.net",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "stg.cube-unit.net"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 0
          + max_ttl                = 0
          + min_ttl                = 0
          + smooth_streaming       = false
          + target_origin_id       = "stg.cube-unit.net.s3.amazonaws.com"
          + trusted_key_groups     = []
          + trusted_signers        = []
          + viewer_protocol_policy = "allow-all"

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::158677943024:function/cloudfront-s3-redirect"
            }

          + grpc_config {
              + enabled = false
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "stg.cube-unit.net.s3.amazonaws.com"
          + origin_access_control_id = "E2VDBZY3AJRCX4"
          + origin_id                = "stg.cube-unit.net.s3.amazonaws.com"
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = "arn:aws:acm:us-east-1:158677943024:certificate/3c2958b2-78f2-41d4-b349-ac66cc453548"
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
        }
    }

  # aws_s3_bucket_policy.policy will be created
  + resource "aws_s3_bucket_policy" "policy" {
      + bucket = "stg.cube-unit.net"
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "ap-northeast-1"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"f72b64dac7666648be26563ba75e90fb68138379","Target":"stg.cube-unit.net","Vars":{},"WorkflowName":"terraform-pull-request"} -->